GeFengthe/RTL8762/src/app/mesh/group_rcu/rcu_app.c
/**
*********************************************************************************************************
*               Copyright(c) 2015, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* @file      rcu_app.c
* @brief    mesh RCU application file
* @details
* @author    elliot chen
* @date      2018-9-13
* @version   v1.0
* *********************************************************************************************************
*/

/* Includes ------------------------------------------------------------------*/
#include "board.h"
#include <string.h>
#include <app_msg.h>
#include <trace.h>
#include <gap_scan.h>
#include <gap.h>
#include <gap_msg.h>
#include <gap_adv.h>
#include <gap_bond_le.h>
#include <profile_server.h>
#include "rtl876x.h"
#include "trace.h"
#include "gap_wrapper.h"
#include "mesh_api.h"
#include "ping_app.h"
#include "rcu_app.h"
#include "dfu_server.h"
#include "dfu_client.h"
#include "otp_config.h"
#include "sha256.h"
#include "stdio.h"
#include "gap_vendor.h"
#include "key_handle.h"
#ifdef BAT_EN
#include "battery_driver.h"
#endif
#include "group.h"
#include "led_driver.h"

/* Defines ------------------------------------------------------------------*/
/**
 * @brief  Application Link control block definition.
 */
typedef struct
{
    T_GAP_CONN_STATE        conn_state;          /**< Connection state. */
    T_GAP_REMOTE_ADDR_TYPE  bd_type;             /**< remote BD type*/
    uint8_t                 bd_addr[GAP_BD_ADDR_LEN]; /**< remote BD */
} T_APP_LINK;

/* Globals ------------------------------------------------------------------*/
T_GAP_DEV_STATE gap_dev_state = {0, 0, 0, 0};                 /**< GAP device state */
T_APP_LINK app_link_table[APP_MAX_LINKS];

void app_handle_gap_msg(T_IO_MSG *p_gap_msg);
extern void app_nvic_config(void);

/**
 * @brief    All the application messages are pre-handled in this function
 * @note     All the IO MSGs are sent to this function, then the event handling
 *           function shall be called according to the MSG type.
 * @param[in] io_msg  IO message data
 * @return   void
 */
void app_handle_io_msg(T_IO_MSG io_msg)
{
    uint16_t msg_type = io_msg.type;
    switch (msg_type)
    {
    case IO_MSG_TYPE_KEYSCAN:
        {
            if (key_handle_global_data.combine_keys_status != INVALID_COMBINE_KEYS_BIT_MASK)
            {
                /* reset combine keys bit mask and timer */
                key_handle_global_data.combine_keys_status = INVALID_COMBINE_KEYS_BIT_MASK;

                if (combine_keys_detection_timer != NULL)
                {
                    os_timer_stop(&combine_keys_detection_timer);
                }
            }

            if (io_msg.subtype == IO_MSG_KEYSCAN_ALLKEYRELEASE)
            {
                key_handle_release_event(io_msg.u.buf);
            }
            else if (io_msg.subtype == IO_MSG_KEYSCAN_RX_PKT)
            {
                key_handle_pressed_event(io_msg.u.buf);
            }
        }
        break;
#ifdef BAT_EN
    case IO_MSG_TYPE_BAT_LPC:
        {
            battery_msg_handle(msg_type);
        }
        break;
#endif
    case IO_MSG_TYPE_BT_STATUS:
        app_handle_gap_msg(&io_msg);
        break;
    case IO_MSG_TYPE_TIMER:
        if (io_msg.subtype == IO_MSG_KEYSCAN_LONG_PRESS)
        {
            key_handle_long_pressed_event(io_msg.u.buf);
        }
        else if (io_msg.subtype == IO_MSG_KEYSCAN_REPEAT_SEND)
        {
            key_handle_pressed_event(io_msg.u.buf);
        }
        break;
    case DFU_SERVER_TIMEOUT_MSG:
        dfu_server_adv_send();
        break;
#if (ROM_WATCH_DOG_ENABLE == 1)
    case IO_MSG_TYPE_RESET_WDG_TIMER:
        {
            APP_PRINT_INFO0("[WDG] Watch Dog Rset Timer");
            WDG_Restart();
        }
        break;
#endif
    default:
        break;
    }
}

/**
 * @brief    Handle msg GAP_MSG_LE_DEV_STATE_CHANGE
 * @note     All the gap device state events are pre-handled in this function.
 *           Then the event handling function shall be called according to the new_state
 * @param[in] new_state  New gap device state
 * @param[in] cause GAP device state change cause
 * @return   void
 */
void app_handle_dev_state_evt(T_GAP_DEV_STATE new_state, uint16_t cause)
{
    APP_PRINT_INFO4("app_handle_dev_state_evt: init state  %d, adv state %d, scan state %d, cause 0x%x",
                    new_state.gap_init_state, new_state.gap_adv_state,
                    new_state.gap_scan_state, cause);
    if (gap_dev_state.gap_init_state != new_state.gap_init_state)
    {
        if (new_state.gap_init_state == GAP_INIT_STATE_STACK_READY)
        {
            APP_PRINT_INFO0("GAP stack ready");
            uint8_t bt_addr[6];
            gap_get_param(GAP_PARAM_BD_ADDR, bt_addr);
            APP_PRINT_INFO6("bt addr 0x%x:%x:%x:%x:%x:%x",
                            bt_addr[5], bt_addr[4], bt_addr[3],
                            bt_addr[2], bt_addr[1], bt_addr[0]);

            /* Enable peripheral NVIC after GAP stack ready */
            app_nvic_config();
            /* Initialize group protocol transmission */
            group_transmitter_init();
        }
    }
    gap_dev_state = new_state;
}

/**
 * @brief    Handle msg GAP_MSG_LE_CONN_STATE_CHANGE
 * @note     All the gap conn state events are pre-handled in this function.
 *           Then the event handling function shall be called according to the new_state
 * @param[in] conn_id Connection ID
 * @param[in] new_state  New gap connection state
 * @param[in] disc_cause Use this cause when new_state is GAP_CONN_STATE_DISCONNECTED
 * @return   void
 */
void app_handle_conn_state_evt(uint8_t conn_id, T_GAP_CONN_STATE new_state, uint16_t disc_cause)
{
    if (conn_id >= APP_MAX_LINKS)
    {
        return;
    }

    APP_PRINT_INFO4("app_handle_conn_state_evt: conn_id %d, conn_state(%d -> %d), disc_cause 0x%x",
                    conn_id, app_link_table[conn_id].conn_state, new_state, disc_cause);

    app_link_table[conn_id].conn_state = new_state;
    switch (new_state)
    {
    case GAP_CONN_STATE_DISCONNECTED:
        {
            if ((disc_cause != (HCI_ERR | HCI_ERR_REMOTE_USER_TERMINATE))
                && (disc_cause != (HCI_ERR | HCI_ERR_LOCAL_HOST_TERMINATE)))
            {
                APP_PRINT_ERROR2("app_handle_conn_state_evt: connection lost, conn_id %d, cause 0x%x", conn_id,
                                 disc_cause);
            }
            memset(&app_link_table[conn_id], 0, sizeof(T_APP_LINK));
        }
        break;

    case GAP_CONN_STATE_CONNECTED:
        {
            uint16_t conn_interval;
            uint16_t conn_latency;
            uint16_t conn_supervision_timeout;

            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &conn_interval, conn_id);
            le_get_conn_param(GAP_PARAM_CONN_LATENCY, &conn_latency, conn_id);
            le_get_conn_param(GAP_PARAM_CONN_TIMEOUT, &conn_supervision_timeout, conn_id);
            le_get_conn_addr(conn_id, app_link_table[conn_id].bd_addr,
                             &app_link_table[conn_id].bd_type);
            APP_PRINT_INFO5("GAP_CONN_STATE_CONNECTED:remote_bd %s, remote_addr_type %d, conn_interval 0x%x, conn_latency 0x%x, conn_supervision_timeout 0x%x",
                            TRACE_BDADDR(app_link_table[conn_id].bd_addr), app_link_table[conn_id].bd_type,
                            conn_interval, conn_latency, conn_supervision_timeout);
#if F_BT_LE_5_0_SET_PHY_SUPPORT
            {
                uint8_t tx_phy;
                uint8_t rx_phy;
                le_get_conn_param(GAP_PARAM_CONN_RX_PHY_TYPE, &rx_phy, conn_id);
                le_get_conn_param(GAP_PARAM_CONN_TX_PHY_TYPE, &tx_phy, conn_id);
                APP_PRINT_INFO2("GAP_CONN_STATE_CONNECTED: tx_phy %d, rx_phy %d", tx_phy, rx_phy);
            }
#endif
            le_set_data_len(conn_id, 251, 2120);
        }
        break;

    default:
        break;

